cskilbeck/volume_knob/ch554_firmware_midi/src/main.c
#define PORT1 0x90
#define PORT3 0xB0

#define BTN_PORT PORT3
#define BTN_PIN 3

#define LED_PORT PORT1
#define LED_PIN 6

// Set btn bit (P3.3) as input with pullup

SBIT(BTN_BIT, BTN_PORT, BTN_PIN);
SBIT(LED_BIT, LED_PORT, LED_PIN);

// Main function
int main()
{
    uint8_t length = 0;
    uint8_t Midi_Timeout = 0;
    CfgFsys();       // CH559 clock select configuration
    mDelaymS(5);     // Modify the main frequency and wait for the internal crystal stability, it will be added
    init_uart0();    // Candidate 0, can be used for debugging

    P1_MOD_OC = 0b00000000;
    P1_DIR_PU = 0b01000000;

    P3_MOD_OC = 0b00001010;
    P3_DIR_PU = 0b00001010;

#ifdef DE_PRINTF
    printf("start ...\r\n");
#endif

    USBDeviceCfg();
    USBDeviceEndPointCfg();    // Endpoint configuration
    USBDeviceIntCfg();         // Interrupt initialization
    UEP0_T_LEN = 0;
    UEP1_T_LEN = 0;    // Be pre -use and sending length must be empty
    UEP2_T_LEN = 0;    // Be pre -use and sending length must be empty

#define DEBOUNCE_TIME 0xA0u
#define T2_DEBOUNCE (0xFFu - DEBOUNCE_TIME)

    putstr("Hello\n");

    TR2 = 1;

    uint8_t i = 0;
    while(i < 6) {
        if(TF2 == 1) {
            TL2 = 0;
            TH2 = 0;
            TF2 = 0;
            LED_BIT = !LED_BIT;
            i += 1;
        }
    }

    enum midi_code_index
    {
        mci_misc_function = 0x0,       // 1, 2 or 3    Miscellaneous function codes
        mci_cable_event = 0x1,         // 1, 2 or 3    Reserved for future expansion
        mci_system_common_2 = 0x2,     // 2            Two-byte System Common messages like MTC, SongSelect, etc.
        mci_system_common_3 = 0x3,     // 3            Three-byte System Common messages like SPP, etc.
        mci_sysex_start = 0x4,         // 3            SysEx starts or continues
        mci_sysex_single = 0x5,        // 1            Single-byte System Common Message or SysEx ends with following single byte.
        mci_sysex_end_2 = 0x6,         // 2            SysEx ends with following two bytes.
        mci_sysex_end_3 = 0x7,         // 3            SysEx ends with following three bytes.
        mci_note_off = 0x8,            // 3            Note-off
        mci_note_on = 0x9,             // 3            Note-on
        mci_poly_keypress = 0xA,       // 3            Poly-KeyPress
        mci_control_change = 0xB,      // 3            Control Change
        mci_program_change = 0xC,      // 2            Program Change
        mci_channel_pressure = 0xD,    // 2            Channel Pressure
        mci_pitch_bend = 0xE,          // 3            PitchBend Change
        mci_single_byte = 0xF,         // 1            Single Byte
    };

    LED_BIT = 0;

    bool button_state = false;    // for debouncing the button

    while(1) {

        // read/debounce the button
        bool pressed = false;
        bool new_state = !BTN_BIT;
        if(new_state != button_state && TF2) {
            TL2 = 0;
            TH2 = T2_DEBOUNCE;
            TF2 = 0;
            pressed = new_state;
            button_state = new_state;
        }

        if(UsbConfig) {
            if(USBByteCount) {

                memcpy(Receive_Midi_Buf, Ep2Buffer, USBByteCount);
                UEP2_CTRL = (UEP2_CTRL & ~MASK_UEP_R_RES) | UEP_R_RES_ACK;
                length = USBByteCount;
                USBByteCount = 0;

                hexdump(Receive_Midi_Buf, length);

                if(Receive_Midi_Buf[0] == 0x04 && Receive_Midi_Buf[1] == 0xF0 && Receive_Midi_Buf[2] == 0x7D && Receive_Midi_Buf[3] == 114) {
                    LED_BIT = !LED_BIT;
                }
            }

            if(!UpPoint2_Busy && pressed) {
                Ep2Buffer[MAX_PACKET_SIZE + 0] = 0x0B;
                Ep2Buffer[MAX_PACKET_SIZE + 1] = 0xB0;
                Ep2Buffer[MAX_PACKET_SIZE + 2] = 0x03;
                Ep2Buffer[MAX_PACKET_SIZE + 3] = 0x01;
                UEP2_T_LEN = 4;
                UEP2_CTRL = UEP2_CTRL & ~MASK_UEP_T_RES | UEP_T_RES_ACK;    // Answer ACK
                UpPoint2_Busy = 1;
                length = 0;

                LED_BIT = !LED_BIT;
            }
        }
    }
}
